# Question 1

In [1]:
import pandas as pd

In [8]:
k = (4,8,15,16,23,42)

In [10]:
df = pd.Series(k)
print(k)

(4, 8, 15, 16, 23, 42)

# question 2

In [11]:
l = [1,2,3,44,55,65,67,34,56,89]

In [12]:
df1 = pd.Series(l)
print(df1)

0     1
1     2
2     3
3    44
4    55
5    65
6    67
7    34
8    56
9    89
dtype: int64

In [13]:
type(df1)

pandas.core.series.Series

# question 3

In [18]:
data = {
    'Name' : ['Alice', 'Bob', 'Claire'],
    'Age' : [25,30,27],
    'Gender' :['Female', 'Male', ' Female'],
}

ks = pd.DataFrame(data)
ks

     Name  Age   Gender
0   Alice   25   Female
1     Bob   30     Male
2  Claire   27   Female

# Question 4

sol : A DataFrame is a 2-dimensional data structure in the Pandas library used for data manipulation and analysis. A DataFrame is a table-like data structure where columns have a fixed name, and rows are labeled with unique integer indexes. It can be used to represent both numerical and categorical data with varying data types. Pandas provides powerful functionality for working with DataFrames, including data cleaning, reshaping, aggregation, and visualization. It can be easily imported from CSV, Excel, or other data sources and exported to various formats, including CSV, Excel, and SQL databases.

A pandas DataFrame and a Series are both used to store and work with data in Python. However, they differ in terms of their shape and structure. A DataFrame is a multi-dimensional data structure, where each row represents an observation and each column represents a feature. A Series is a one-dimensional data structure, where each value is a single observation. Additionally, a Series can have missing values while a DataFrame cannot. Here is an example:

In [21]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
series = pd.Series([7, 8, 9])

# question 5

sol:  Pandas, a popular library for data analysis in Python, offers a variety of built-in functions to manipulate data in a DataFrame. Some common functions include: select(), filter(), groupby(), sort_values(), transform(), pivot(), merge(), and fillna(). You can also use the apply() function to apply custom functions to each row or column in the DataFrame. Additionally, the DataFrame can be edited directly using integer indexing and boolean indexing.

In [22]:
ks

     Name  Age   Gender
0   Alice   25   Female
1     Bob   30     Male
2  Claire   27   Female

In [23]:
ks.head(1)

    Name  Age  Gender
0  Alice   25  Female

In [24]:
ks.tail(2)

     Name  Age   Gender
1     Bob   30     Male
2  Claire   27   Female

# question 6

sol:  In Python, `dataframe` is an immutable data structure, meaning it cannot be modified. However, individual columns or rows within a `dataframe` can be modified. Additionally, you can modify the data in place using operations like `loc` and add new columns to the `dataframe` using methods like `assign`.

For mutable data structures, you can use `Series` dataframe panels. `Series` data is mutable, so you can modify the data in place using operations like `loc` and `iloc`. You can also manipulate the data directly using pandas `Series.values` attribute.

# question 7

In [26]:
import pandas as pd

# Creating multiple Series
name_series = pd.Series(['Alice', 'Bob', 'Charlie', 'David'])
age_series = pd.Series([25, 30, 35, 40])
city_series = pd.Series(['New York', 'Los Angeles', 'Chicago', 'Houston'])

# Creating a DataFrame using the Series
data = {'Name': name_series, 'Age': age_series, 'City': city_series}
df = pd.DataFrame(data)

# Displaying the DataFrame
print(df)

      Name  Age         City
0    Alice   25     New York
1      Bob   30  Los Angeles
2  Charlie   35      Chicago
3    David   40      Houston